---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType
source: html/a5e5adae-1c91-3d7b-fb6d-b0c270c70d3c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType

Defines text label visualization types for diagram settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleDiagramTextLabelType
```